integration/src/InformationRegisters/грПрогрессОтложенныхОперацийИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>грПрогрессОтложенныхОперацийИнтеграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаданияРодитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

integration/src/InformationRegisters/грПрогрессОтложенныхОперацийИнтеграции/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДобавитьЗапись(Параметры) Экспорт

	ПараметрыДобавления = Новый Структура;
	
	Если Параметры.Свойство("ФоновоеЗадание") Тогда
		
		ПараметрыДобавления.Вставить("Наименование"			, Параметры.ФоновоеЗадание.Наименование);
		ПараметрыДобавления.Вставить("Начало"				, Параметры.ФоновоеЗадание.Начало);
		ПараметрыДобавления.Вставить("Ключ"					, Строка(Параметры.ФоновоеЗадание.Ключ));
		ПараметрыДобавления.Вставить("ИдентификаторЗадания"	, Строка(Параметры.ФоновоеЗадание.УникальныйИдентификатор));
	
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторЗаданияРодитель") Тогда
		ПараметрыДобавления.Вставить("ИдентификаторЗаданияРодитель" , Строка(Параметры.ИдентификаторЗаданияРодитель));
	КонецЕсли;
	
	Если Параметры.Свойство("Уровень") Тогда
		ПараметрыДобавления.Вставить("Уровень" , Строка(Параметры.Уровень));
	КонецЕсли;
	
	МЗ = РегистрыСведений.грПрогрессОтложенныхОперацийИнтеграции.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, ПараметрыДобавления);
	МЗ.Записать();

КонецПроцедуры

#КонецЕсли
